/**
 * GB/T 33476.2-2016 党政机关电子公文格式规范 第2部分：显现
 */

import type { Section } from './gb9704'

export const gb33476Data: Section[] = [
  {
    id: '1',
    title: '范围',
    content: 'GB/T33476的本部分规定了使用文字处理软件制作显示效果符合GB/T9704-2012的电子公文时应遵循的原则、推荐的参数以及公文域实现要求。\n本部分适用于GB/T9704-2012所述文种的电子公文的编辑与成文。党政机关使用的其他类型的电子公文、其他组织机构或使用少数民族文字制发的电子公文可参照执行。',
  },
  {
    id: '2',
    title: '规范性引用文件',
    content: '下列文件对于本文件的应用是必不可少的。凡是注日期的引用文件,仅注日期的版本适用于本文件。凡是不注日期的引用文件,其最新版本(包括所有的修改单)适用于本文件。\nGB/T9704-2012 党政机关公文格式',
  },
  {
    id: '3',
    title: '术语和定义',
    content: '下列术语和定义适用于本文件。',
    children: [
      {
        id: '3.1',
        title: '显现 display',
        content: '通过设置使公文在计算机系统中达到GB/T9704-2012要求的显示效果。',
      },
      {
        id: '3.2',
        title: '公文域 official document field',
        content: '公文编辑中表示公文要素数据的部分。',
      },
    ],
  },
  {
    id: '4',
    title: '基本原则',
    content: '文字处理软件的排版规则和参数设定与GB/T9704-2012中的定义存在一定差异(参见附录A),当使用文字处理软件处理GB/T9704-2012列出的各类型公文时推荐按照本部分中的参数执行。\n电子公文的版面和公文各要素的最终显示效果应符合GB/T9704-2012。',
  },
  {
    id: '5',
    title: '字库',
    content: '应按照GB/T9704-2012对字体的要求,使用通过国家认可的第三方测试机构检测的字库。',
  },
  {
    id: '6',
    title: '页面设置',
    children: [
      {
        id: '6.1',
        title: '纸张大小',
        content: '采用A4纸型,尺寸设置为:210mm x 297mm。',
      },
      {
        id: '6.2',
        title: '页面边距',
        content: '页面边距主要参数设置如下:\n---上边距:34.58mm;\n---下边距:32.58mm;\n---左边距:28mm;\n---右边距:26mm。',
      },
    ],
  },
  {
    id: '7',
    title: '公文要素显现规则',
    children: [
      {
        id: '7.1',
        title: '版头',
        children: [
          {
            id: '7.1.1',
            title: '发文机关标志',
            content: '发文机关标志上边缘至版心上边缘的距离为37.42mm。',
          },
          {
            id: '7.1.2',
            title: '发文字号',
            content: '发文字号上边缘至发文机关名称下边缘的距离为两行,即20.78mm。',
          },
          {
            id: '7.1.3',
            title: '签发人',
            content: '签发人上边缘至发文机关名称下边缘的距离为两行,即20.78mm。\n两个以上签发人需要回行时,每行签发人姓名第一个字应对齐。\n发文字号应始终与最后一个签发人姓名处于同一行。',
          },
          {
            id: '7.1.4',
            title: '版头中的分隔线',
            content: '红色分割线上边缘至发文字号下边缘的距离为4mm。',
          },
        ],
      },
      {
        id: '7.2',
        title: '主体',
        children: [
          {
            id: '7.2.1',
            title: '标题',
            content: '标题上边缘至版头中红色分隔线的距离为两行,即20.78mm。',
          },
          {
            id: '7.2.2',
            title: '主送机关',
            content: '主送机关上边缘至标题下边缘的距离为一行,即10.39mm。',
          },
          {
            id: '7.2.3',
            title: '正文',
            content: '正文段落首行缩进两个三号字,需要编号编排时,编号形式依次采用"一、""（一）""1.""（1）",超过四级时,可采用其他编号形式。',
          },
          {
            id: '7.2.4',
            title: '附件说明',
            content: '附件说明文字上边缘至正文最后一段文字下边缘的距离为一行,即10.39mm。\n附件名称回行时,应与上一行附件名称首字对齐。',
          },
          {
            id: '7.2.5',
            title: '印章相关的排版',
            children: [
              {
                id: '7.2.5.1',
                title: '加盖公章的公文',
                content: '成文日期右对齐,右缩进四字。\n单一行文时,印章顶端至正文文字(或附件说明)下边缘的距离小于一行,即<=10.39mm。\n联合行文时,首排印章顶端至正文文字(或附件说明)下边缘的距离小于一行,即<=10.39mm。',
              },
              {
                id: '7.2.5.2',
                title: '加盖签名章的公文',
                content: '签发人签名章右对齐,右缩进四字。签名章上边缘至正文(或附件说明)下边缘的距离为两行,即20.78mm。签发人职务位于签名章左侧空两字处,两者居中对齐。\n成文日期上边缘至签名章下边缘的距离为一行,即10.39mm。',
              },
              {
                id: '7.2.5.3',
                title: '不加盖印章的公文',
                content: '单一机关行文时,发文机关署名上边缘至正文(或附件说明)下边缘的距离为一行,即10.39mm。\n发文机关署名右对齐,并且右缩进两字。成文日期首字比发文机关署名首字右移二字。如成文日期长于发文机关署名,成文日期右对齐,并且右缩进两字;发文机关署名右缩进字数可适当增加。',
              },
              {
                id: '7.2.5.4',
                title: '特殊情况说明',
                content: '当公文排版后所剩空白处不能容下发文机关或签发人署名以及成文日期时,文字处理软件应支持采取调整行距、字距的措施加以解决。',
              },
            ],
          },
          {
            id: '7.2.6',
            title: '附注',
            content: '附注上边缘至成文日期下边缘的距离为一行,即10.39mm。',
          },
        ],
      },
      {
        id: '7.3',
        title: '版记',
        children: [
          {
            id: '7.3.1',
            title: '页面和分隔线',
            content: '版记应编排在偶数页上,版记中末条分隔线与公文最后一面的版心下边缘重合。',
          },
          {
            id: '7.3.2',
            title: '抄送机关',
            content: '"抄送:"左缩进一字;抄送机关右缩进一字,抄送机关回行时,抄送机关首字与上一行抄送机关首字对齐。如有主送机关,排版方式与抄送机关一致。',
          },
          {
            id: '7.3.3',
            title: '印发机关和印发日期',
            content: '印发机关左缩进一字,印发日期右缩进一字。',
          },
        ],
      },
    ],
  },
  {
    id: '8',
    title: '页码',
    content: '版心下边缘至页码一字线中心的距离为4.58mm。单页码右对齐,右缩进一字;双页码左对齐,左缩进一字。',
  },
  {
    id: '9',
    title: '公文的特定格式',
    children: [
      {
        id: '9.1',
        title: '信函',
        content: '发文机关标志上边缘至页面上边缘的距离为30mm,上部的红色双线(上粗下细)至发文机关名称下边缘的距离为4mm,底部的红色双线(上细下粗)至页面下边缘的距离为20mm,两条线长均为170mm。\n在红色双线(上粗下细)下4.84mm处编排份号、密级和保密期限、紧急程度。\n发文字号至红色双线(上粗下细)的距离为4.84mm。\n标题水平居中,其上边缘与其上最后一个要素的下边缘相距两行,即20.78mm。\n第二条红色双线上一行如有文字,其下边缘至该线的距离为4.84mm。',
      },
      {
        id: '9.2',
        title: '命令',
        content: '发文机关标志上边缘距版心上边缘20mm。\n令号上边缘至发文机关标志下边缘的距离为两行,即20.78mm。\n正文上边缘至令号下边缘的距离为两行,即20.78mm。',
      },
      {
        id: '9.3',
        title: '纪要',
        content: '出席人员名单上边缘至正文(或附件说明)下边缘的距离为一行,即10.39mm。\n出席人员名单左缩进两字。出席人员姓名回行时与冒号后的首字对齐。',
      },
    ],
  },
]
